{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[21, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    10, 
    11, 
    14, 
    15, 
    19, 
    20
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23
  ], 
  "heads": [[22, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}